Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals
The MepUnitsDecimals class represents the Mep units and decimals defined in options.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.MassFlowUnit
The Mep mass flow unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.DensityUnit
The Mep density unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.SpecificHeatCapacityUnit
The Mep specific heat capacity unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.VelocityUnit
The Mep velocity unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.VolumeFlowUnit
The Mep velocity unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.PressureLossUnit
The Mep pressure loss unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.FlowCoefficientUnit
The Mep pressure loss unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.DynamicViscosityUnit
The Mep dynamic viscosity unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.PowerConsumptionUnit
The Mep power consumption unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.KinematicViscosityUnit
The Mep kinematic viscosity unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.MassFlowUnitDecimals
The Mep mass flow unit decimals.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.DensityUnitDecimals
The Mep density unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.SpecificHeatCapacityUnitDecimals
The Mep specific heat capacity unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.VelocityUnitDecimals
The Mep velocity unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.VolumeFlowUnitDecimals
The Mep velocity unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.PressureLossUnitDecimals
The Mep pressure loss unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.FlowCoefficientUnitDecimals
The Mep pressure loss unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.DynamicViscosityUnitDecimals
The Mep dynamic viscosity unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.PowerConsumptionUnitDecimals
The Mep power consumption unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.KinematicViscosityUnitDecimals
The Mep kinematic viscosity unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.GlycolPercentageDecimals
The Mep glycol percentage decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.ZetaDecimals
The Mep zeta decimals (1-6).